[
   {
       "id": "1",
       "job_title": "Regional Manager",
       "work_location": "West/North (Mumbai/Delhi)",
       "position": "1",
       "experience":"6-7 years",
       "qualities": "He must be graduate/Post Graduate. Minimum 6/7 years of Insurance Experience out of which 3 years of Team Handling Exposure is required. Successful track record and Experience Insurance Broking would be an added advantage.",
       "roles_res": "Regional Manager will be primarily responsible for business development and corporate sales for all Life, Health & General Insurance Products in the assigned region. Primary responsibilities include Business Development, complete Account Management, regional sales strategy development and execution, daily Sales Operation, revenue generation, forecasting, sales pipeline management, Lead generation, reviewing competition with constant benchmarking, and Market share increase.In charge of new corporate & insurance tie-ups for sales of Life Insurance products, Health Insurance, general Insurance and implement various sales models including worksite, third party tie-ups, broker models. Help achieve sales revenue goals of the company under the leadership of Zone Vice President/ National Head along with strategizing future growth and stronger market penetration. Work on respective market sales funnels by developing and supporting the front-line sales team with account closures. Acquire and maintain relationships with existing and new customers with a focus on stakeholders, decision-makers & influencer management. Responsible for high-level external/internal client management. Also assisting new product development and aligning a sales strategy to ensure market edge. Constantly developing and coordinating sales selling cycle and methodology. Analyze and evaluate the effectiveness of current sales, methods, costs, and results. Responsible for increasing awareness and utilization amongst existing clientele about the service offerings vide onsite campaigns, e-based marketing campaigns, and other marketing initiatives."
    },
   {
        "id": "2",
        "job_title": "Manager Sales Training (L&D profile)",
        "work_location": "Delhi/Gurgaon.",
        "position": "1",
        "experience":"3-5 years",
        "qualities": "She/he must be graduate. Min 3-5 years’ experience. Should be able to deliver Training Contents to Sales Team in person in one to many and also in Video Calls Formats. Proficient in PPT’s and other training Presentations formats. Exposure in insurance industry training is a must. Experience in Insurance Broking would be an added advantage.",
        "roles_res": "To manage training & development objective of the allotted partner branches /cluster’s POSP’s on Life Insurance/ Health Insurance/General Insurance. To ensure optimal training coverage to realize desired sales & product mix objective. ·To plan training calendar and ensure training coverage as per planned calendar & training needs & agreed Goals of the month. To ensure that right selling behavior, sales ethics and right sales practices are embedded through the training imparted in line with company standards and regulations. To closely work with the sales team & Partner Team to formulate training strategy as per need. To ensure delivery of skill, behavioral & sales oriented training. Should be able to capture products Features and Benefits on presentation templates."
   },
    {
        "id": "3",
        "job_title": "Zonal Vice President",
        "work_location": "Mumbai (Powai)",
        "position": "1",
        "experience":"minimum 10 years",
        "qualities": "He must be graduate/Post Graduate. Minimum 10 years of Insurance Experience out of which 5-6 years of Team Handling Exposure is a must. Successful track record and Experience in Insurance Broking would be an added advantage. Proven Experience in managing and effectively driving the sales team to achieve annual targets. Comfortable in establishing relationship especially at higher levels in a given corporate.   ",
        "roles_res": "Ensuring and strengthening Insurance tie-up with different Insurance companies and maintaining a good cordial working relationship with their officials. Achieving the targets assigned by top management thereby ensuring profitability for the organization. Having a good customer orientation and involvement with all the key stakeholders. Keeping a good close track of market, so as to be in control of the situation at all times. Development of all the resources attached in terms of their morale, motivation, skill sets, market updates, competitive edge and seasonality. Brand promotion / awareness in order to ensure a good visibility and hence the reach. He should also be well-versed with accounts management, strategizing for his team, process orientation, revenue generation, funnel management and various aspects of lead generation, so as to keep the team engaged."
    },
    {
        "id": "4",
        "job_title": "Search Engine Optimization",
        "work_location": "Mumbai (Powai)",
        "position": "1",
        "experience":"3-5 years",
        "qualities": "He/She must be graduate. Min 3 to 5 years’ experience in similar profile. Good oral and written communication skills.",
        "roles_res": "You will be responsible for managing all SEO activities such as content strategy, backlink building and keyword strategy to increase rankings on all major search networks. Perform ongoing keyword discovery, expansion and optimization. Research and implement search engine optimization recommendations. Will be well known to website SEO and App SEO and On page and Off page backlink building. Work with the development team to ensure SEO best practices are properly implemented on newly developed code. Work with editorial and marketing teams to drive SEO in content creation and content programming. Recommend changes to website architecture, content, linking and other factors to improve SEO positions for target keywords."
    },
    {
        "id": "5",
        "job_title": "Sales Manager",
        "work_location": "Mumbai/Pune/Delhi/Gurgaon",
        "position": "1",
        "experience":"1-5 years",
        "qualities": "He must be graduate. Minimum 1 -5 years of Experience. Exposure in insurance industry training is a must. Experience in Insurance Broking would be an added advantage.",
        "roles_res": "Ensuring and strengthening Insurance tie-up with different Insurance companies and maintaining a good cordial working relationship with their officials. Achieving the targets assigned by top management thereby ensuring profitability for the organization. Having a good customer orientation and involvement with all the key stakeholders. Recruit, train Point Of Sale Person and generate business through them in the assigned Location/Region. Responsible for Onboarding & tracking activation of the same regularly. Business Development in Life/Health/General Insurance. Interdepartmental Coordination with other departments such as U/W, Claims, & Operations. Keeping a good close track of market, so as to be in control of the situation at all times. Development of all the resources attached in terms of their morale, motivation, skill sets, market updates, competitive edge and seasonality."
    }

]